In [2]:
import pandas as pd 
import numpy as np

In [66]:
df = pd.read_csv('/Users/danialmendigali/jupyter-datascience/Pandas/data set /Fortnite Statistics.csv')
df1 = pd.read_csv('/Users/danialmendigali/jupyter-datascience/Pandas/data set /Titanic-Dataset.csv')

In [27]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.head(5)

,Date,Time of Day,Placed,Mental State,Eliminations,Assists,Revives,Accuracy,Hits,Head Shots,Distance Traveled,Materials Gathered,Materials Used,Damage Taken,Damage to Players,Damage to Structures
0,4/10,6:00 PM,27,sober,2,0,0,23%,14,2,271.08,20,20,272,331,621
1,4/10,6:00 PM,45,sober,1,2,0,30%,19,1,396.73,123,30,247,444,998
2,4/10,6:00 PM,38,high,3,0,0,30%,32,1,607.80,71,60,176,322,1109
3,4/10,7:00 PM,30,high,1,3,0,18%,19,1,714.16,244,10,238,330,4726
4,4/10,7:00 PM,16,high,3,1,1,58%,42,18,1140.00,584,150,365,668,2070

# Добавление колонок

In [7]:
df['skin'] =  "Vladika lda"

In [8]:
df.head(5)

,Date,Time of Day,Placed,Mental State,Eliminations,Assists,Revives,Accuracy,Hits,Head Shots,Distance Traveled,Materials Gathered,Materials Used,Damage Taken,Damage to Players,Damage to Structures,skin
0,4/10,6:00 PM,27,sober,2,0,0,23%,14,2,271.08,20,20,272,331,621,Vladika lda
1,4/10,6:00 PM,45,sober,1,2,0,30%,19,1,396.73,123,30,247,444,998,Vladika lda
2,4/10,6:00 PM,38,high,3,0,0,30%,32,1,607.80,71,60,176,322,1109,Vladika lda
3,4/10,7:00 PM,30,high,1,3,0,18%,19,1,714.16,244,10,238,330,4726,Vladika lda
4,4/10,7:00 PM,16,high,3,1,1,58%,42,18,1140.00,584,150,365,668,2070,Vladika lda

In [12]:
df['skin'] = 'Unknown'
df.loc[df['Hits'] < 20, 'skin'] = 'Banana'
df.loc[df['Hits'].between(20, 25), 'skin'] = 'Vladika'
df.loc[df['Hits'] > 25, 'skin'] = 'SeniorPomidor'

In [22]:
df.tail(20)

,Date,Time of Day,Placed,Mental State,Eliminations,Assists,Revives,Accuracy,Hits,Head Shots,Distance Traveled,Materials Gathered,Materials Used,Damage Taken,Damage to Players,Damage to Structures,skin
67,4/15,1:00 PM,17,sober,2,0,0,27%,32,1,1650.00,317,160,270,502,2029,SeniorPomidor
68,4/15,1:00 PM,13,sober,6,2,0,13%,38,7,1890.00,1560,140,367,1005,9540,SeniorPomidor
69,4/15,2:00 PM,5,sober,6,3,0,11%,29,3,3350.00,421,230,366,764,11077,SeniorPomidor
70,4/15,2:00 PM,41,sober,0,1,0,25%,8,3,161.73,75,10,109,250,565,Banana
71,4/15,5:00 PM,25,high,2,2,1,28%,20,5,494.14,49,0,134,467,736,Vladika
72,4/15,5:00 PM,20,high,0,3,0,16%,7,2,498.11,78,0,172,315,2081,Banana
73,4/15,5:00 PM,15,high,2,2,1,10%,13,4,792.00,118,110,313,471,3383,Banana
74,4/15,6:00 PM,1,high,4,5,0,16%,35,3,4460.00,941,350,182,997,5787,SeniorPomidor
75,4/15,6:00 PM,22,high,3,3,1,34%,78,5,361.31,0,0,329,362,990,SeniorPomidor
76,4/15,10:00 PM,15,sober,3,0,1,36%,83,13,336.46,175,10,223,1014,2434,SeniorPomidor
77,4/15,11:00 PM,34,sober,2,2,1,53%,61,3,314.10,60,0,106,658,415,SeniorPomidor
78,4/15,11:00 PM,15,sober,1,1,1,45%,30,0,1170.00,99,80,151,286,553,SeniorPomidor
79,4/15,11:00 PM,4,sober,5,2,2,42%,52,0,3550.00,850,450,436,724,1377,SeniorPomidor
80,16-Apr,10:00 PM,24,high,1,1,2,64%,7,2,249.22,108,0,196,468,1590,Banana
81,16-Apr,11:00 PM,17,high,3,2,2,33%,65,20,752.64,62,60,202,1222,2200,SeniorPomidor
82,17-Apr,12:00 AM,2,high,8,2,0,31%,97,8,3770.00,1750,400,576,1492,4593,SeniorPomidor
83,17-Apr,12:00 AM,24,high,4,0,0,20%,12,4,222.54,94,0,96,478,2262,Banana
84,17-Apr,1:00 PM,30,sober,1,2,0,28%,40,4,267.00,78,30,148,375,1196,SeniorPomidor
85,17-Apr,2:00 PM,18,sober,3,2,1,26%,25,3,954.43,370,60,354,475,1168,Vladika
86,17-Apr,2:00 PM,39,sober,1,0,0,31%,12,1,226.67,75,0,120,338,1105,Banana

In [35]:
df1['is_adult'] = np.where(df1['Age'] >= 18, 'Yes', 'No')
df1.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,is_adult
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Yes
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Yes
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Yes
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Yes
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Yes
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,No
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,Yes
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,No
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,Yes
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,No

In [46]:
df1['is_male'] = np.where(df1['Sex'] == 'male', 1, 0)
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,is_adult,is_male
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Yes,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Yes,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Yes,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Yes,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Yes,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Yes,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Yes,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,No,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Yes,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Yes,1

In [55]:
df1['age_group'] = np.where(
    df1['Age'] < 18, 'Child',
    np.where(df1['Age'] < 60, 'Adult', 'Senior')
)
df1.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,is_adult,is_male,age_group
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,Yes,1,Adult
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,Yes,0,Adult
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,No,0,Senior
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,Yes,1,Adult
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Yes,1,Adult

In [60]:
n = df1.loc[
    (df1['Age'] > 59)
]
n.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,is_adult,is_male,age_group
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S,Yes,1,Senior
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C,Yes,1,Senior
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,Yes,1,Senior
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q,Yes,1,Senior
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S,Yes,1,Senior

In [79]:
df1['age_group'] = np.where(
    df1['Age'] < 18, 'Child',
    np.where(df1['Age'] < 60, 'Adult', 'Senior')
)
d = df1.loc[
    (df1['Age'] > 60)
]
d.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_group
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.000,A23,S,Senior
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.500,NaN,S,Senior
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.000,B22,S,Senior
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.000,B28,NaN,Senior
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.775,NaN,S,Senior

In [81]:
df1['fare_group'] = np.where(
    df1['Fare'] < 20, 'low',
    np.where(df1['Fare'].between(20, 50), 'medium', 'high')
)
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_group,fare_group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Adult,low
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult,high
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult,low
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult,high
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult,low
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Adult,low
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Adult,medium
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Senior,medium
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Adult,medium
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Adult,low

In [88]:
df1.groupby('age_group')['Age'].mean()

age_group
Adult     32.158261
Child      9.041327
Senior    65.096154
Name: Age, dtype: float64

In [89]:
df1.groupby('fare_group')['Fare'].mean()

fare_group
high      108.303202
low         9.727127
medium     29.425772
Name: Fare, dtype: float64

In [91]:
pr1 = df1.loc[
    (df1['Sex'] == 'male') & 
    (df1['Age'] > 30)
]
pr1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_group,fare_group
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult,low
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,Adult,high
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,Adult,medium
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S,Adult,medium
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S,Adult,low
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S,Adult,high
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,Adult,low
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S,Adult,low
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S,Adult,low
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Adult,low

In [93]:
pr2 = df1.loc[
    (df1['Sex'] == 'female') &
    (df1['Pclass'] == 1) &
    (df1['Fare'] > 50)
]
pr2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_group,fare_group
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult,high
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult,high
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C,Senior,high
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C,Adult,high
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN,Adult,high
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
835,836,1,1,"Compton, Miss. Sara Rebecca",female,39.0,1,1,PC 17756,83.1583,E49,C,Adult,high
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C,Senior,high
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S,Adult,high
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,Adult,high
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,Adult,high

In [99]:
pr3 = df1.loc[
    (df1['Name'].str.contains(r'Mrs\.|Miss\.', case=False))
]
pr3

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_group,fare_group
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult,high
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult,low
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult,high
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,Adult,low
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,Child,medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,Adult,medium
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,Adult,low
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,Adult,medium
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Adult,medium
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Senior,medium

In [100]:
pr4 = df1.loc[
    (df1['age_group'] == 'Child') &
    (df1['Survived'] == 1)
]
pr4

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_group,fare_group
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,0,237736,30.0708,NaN,C,Child,medium
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S,Child,low
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.00,0,0,330923,8.0292,NaN,Q,Child,low
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.00,1,0,2651,11.2417,NaN,C,Child,low
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C,Child,medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C,Child,low
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S,Child,low
853,854,1,1,"Lines, Miss. Mary Conover",female,16.00,0,1,PC 17592,39.4000,D28,S,Child,medium
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S,Child,low
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.00,0,0,2667,7.2250,NaN,C,Child,low

In [179]:
df = pd.read_csv('/Users/danialmendigali/jupyter-datascience/Pandas/data set /insurance.csv')

In [8]:
df.head(10)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520
5   31  female  25.740         0     no  southeast   3756.62160
6   46  female  33.440         1     no  southeast   8240.58960
7   37  female  27.740         3     no  northwest   7281.50560
8   37    male  29.830         2     no  northeast   6406.41070
9   60  female  25.840         0     no  northwest  28923.13692

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [10]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [12]:
df.shape

(1338, 7)

In [14]:
df['age_group'] = np.where(
    df['age'] < 30, 'young',
    np.where(df['age'].between(30, 50), 'adult', 'senior')
)
df

      age     sex     bmi  children smoker     region      charges age_group
0      19  female  27.900         0    yes  southwest  16884.92400     young
1      18    male  33.770         1     no  southeast   1725.55230     young
2      28    male  33.000         3     no  southeast   4449.46200     young
3      33    male  22.705         0     no  northwest  21984.47061     adult
4      32    male  28.880         0     no  northwest   3866.85520     adult
...   ...     ...     ...       ...    ...        ...          ...       ...
1333   50    male  30.970         3     no  northwest  10600.54830     adult
1334   18  female  31.920         0     no  northeast   2205.98080     young
1335   18  female  36.850         0     no  southeast   1629.83350     young
1336   21  female  25.800         0     no  southwest   2007.94500     young
1337   61  female  29.070         0    yes  northwest  29141.36030    senior

[1338 rows x 8 columns]

In [22]:
df['bmi_category'] = np.where(
    df['bmi'] < 18.5, 'underweight',
    np.where(
        df['bmi'].between(18.5, 25), 'normal',
        np.where(df['bmi'].between(25, 30), 'overweight', 'obese')
    )
)
df.tail(5)

,age,sex,bmi,children,smoker,region,charges,age_group,bmi_category
1333,50,male,30.97,3,no,northwest,10600.5483,adult,obese
1334,18,female,31.92,0,no,northeast,2205.9808,young,obese
1335,18,female,36.85,0,no,southeast,1629.8335,young,obese
1336,21,female,25.80,0,no,southwest,2007.9450,young,overweight
1337,61,female,29.07,0,yes,northwest,29141.3603,senior,overweight

In [24]:
df['bmi_category'].value_counts()

bmi_category
obese          705
overweight     386
normal         227
underweight     20
Name: count, dtype: int64

In [26]:
d = df.loc[
    (df['smoker'] == 'yes')
]
d

,age,sex,bmi,children,smoker,region,charges,age_group,bmi_category
0,19,female,27.900,0,yes,southwest,16884.92400,young,overweight
11,62,female,26.290,0,yes,southeast,27808.72510,senior,overweight
14,27,male,42.130,0,yes,southeast,39611.75770,young,obese
19,30,male,35.300,0,yes,southwest,36837.46700,adult,obese
23,34,female,31.920,1,yes,northeast,37701.87680,adult,obese
...,...,...,...,...,...,...,...,...,...
1313,19,female,34.700,2,yes,southwest,36397.57600,young,obese
1314,30,female,23.655,3,yes,northwest,18765.87545,adult,normal
1321,62,male,26.695,0,yes,northeast,28101.33305,senior,overweight
1323,42,female,40.370,2,yes,southeast,43896.37630,adult,obese
1337,61,female,29.070,0,yes,northwest,29141.36030,senior,overweight

In [28]:
d = df.loc[
    (df['smoker'] == 'yes') &
    (df['age'] > 40)
]
d

,age,sex,bmi,children,smoker,region,charges,age_group,bmi_category
11,62,female,26.290,0,yes,southeast,27808.72510,senior,overweight
39,60,male,39.900,0,yes,southwest,48173.36100,senior,obese
52,48,male,28.000,1,yes,southwest,23568.27200,adult,overweight
55,58,male,36.955,2,yes,northwest,47496.49445,senior,obese
58,53,female,22.880,1,yes,southeast,23244.79020,senior,normal
...,...,...,...,...,...,...,...,...,...
1303,43,male,27.800,0,yes,southwest,37829.72420,adult,overweight
1304,42,male,24.605,2,yes,northeast,21259.37795,adult,normal
1321,62,male,26.695,0,yes,northeast,28101.33305,senior,overweight
1323,42,female,40.370,2,yes,southeast,43896.37630,adult,obese
1337,61,female,29.070,0,yes,northwest,29141.36030,senior,overweight

In [35]:
pr = df.loc[
    (df['charges'] > df['charges'].mean())
]
pr

,age,sex,bmi,children,smoker,region,charges,age_group,bmi_category
0,19,female,27.900,0,yes,southwest,16884.92400,young,overweight
3,33,male,22.705,0,no,northwest,21984.47061,adult,normal
9,60,female,25.840,0,no,northwest,28923.13692,senior,overweight
11,62,female,26.290,0,yes,southeast,27808.72510,senior,overweight
14,27,male,42.130,0,yes,southeast,39611.75770,young,obese
...,...,...,...,...,...,...,...,...,...
1318,35,male,39.710,4,no,northeast,19496.71917,adult,obese
1321,62,male,26.695,0,yes,northeast,28101.33305,senior,overweight
1323,42,female,40.370,2,yes,southeast,43896.37630,adult,obese
1328,23,female,24.225,2,no,northeast,22395.74424,young,normal
1337,61,female,29.070,0,yes,northwest,29141.36030,senior,overweight

In [36]:
pr1 = df.loc[
    (df['bmi_category'] == 'obese')
]
pr1

,age,sex,bmi,children,smoker,region,charges,age_group,bmi_category
1,18,male,33.77,1,no,southeast,1725.55230,young,obese
2,28,male,33.00,3,no,southeast,4449.46200,young,obese
6,46,female,33.44,1,no,southeast,8240.58960,adult,obese
12,23,male,34.40,0,no,southwest,1826.84300,young,obese
13,56,female,39.82,0,no,southeast,11090.71780,senior,obese
...,...,...,...,...,...,...,...,...,...
1331,23,female,33.40,0,no,southwest,10795.93733,young,obese
1332,52,female,44.70,3,no,southwest,11411.68500,senior,obese
1333,50,male,30.97,3,no,northwest,10600.54830,adult,obese
1334,18,female,31.92,0,no,northeast,2205.98080,young,obese
1335,18,female,36.85,0,no,southeast,1629.83350,young,obese

In [40]:
pr2 = df.loc[
    (df['charges'] < df['charges'].mean()) &
    (df['smoker'] == 'no')
]
pr2

,age,sex,bmi,children,smoker,region,charges,age_group,bmi_category
1,18,male,33.77,1,no,southeast,1725.5523,young,obese
2,28,male,33.00,3,no,southeast,4449.4620,young,obese
4,32,male,28.88,0,no,northwest,3866.8552,adult,overweight
5,31,female,25.74,0,no,southeast,3756.6216,adult,overweight
6,46,female,33.44,1,no,southeast,8240.5896,adult,obese
...,...,...,...,...,...,...,...,...,...
1332,52,female,44.70,3,no,southwest,11411.6850,senior,obese
1333,50,male,30.97,3,no,northwest,10600.5483,adult,obese
1334,18,female,31.92,0,no,northeast,2205.9808,young,obese
1335,18,female,36.85,0,no,southeast,1629.8335,young,obese
1336,21,female,25.80,0,no,southwest,2007.9450,young,overweight

In [42]:
df.groupby('sex')['charges'].mean()

sex
female    12569.578844
male      13956.751178
Name: charges, dtype: float64

In [43]:
df.groupby('smoker')['charges'].mean()

smoker
no      8434.268298
yes    32050.231832
Name: charges, dtype: float64

In [50]:
df.groupby('region')['charges'].mean()

region
northeast    13406.384516
northwest    12417.575374
southeast    14735.411438
southwest    12346.937377
Name: charges, dtype: float64

In [55]:
df.groupby('age_group')['bmi'].mean()

age_group
adult     30.610425
senior    31.703062
young     29.847590
Name: bmi, dtype: float64

In [58]:
float(df['charges'].mean())

13270.422265141257

In [59]:
float(df['charges'].median())

9382.033

In [61]:
float(df['charges'].std())

12110.011236694001

In [62]:
print(df['charges'].max() - df['charges'].min())

62648.554110000005

# Работа с пропусками и дубликатами(df.isnull().sum(), dropna(), fillna(), duplicated(), drop_duplicates())

In [252]:
# Создадим пропуски в числовых колонках (например, 5 случайных значений в age и bmi)
df.loc[np.random.choice(df.index, 5, replace=False), 'age'] = np.nan
df.loc[np.random.choice(df.index, 5, replace=False), 'bmi'] = np.nan

# Создадим пропуски в категориальных колонках (sex, smoker)
df.loc[np.random.choice(df.index, 3, replace=False), 'sex'] = np.nan
df.loc[np.random.choice(df.index, 3, replace=False), 'smoker'] = np.nan

In [223]:
df.isnull().sum()

age         25
sex         15
bmi         25
children     0
smoker      18
region       0
charges      0
dtype: int64

In [148]:
pr = df.loc[
    (df['age'].isnull()) 
]
pr

      age     sex     bmi  children smoker     region      charges
13    NaN  female  39.820         0     no  southeast  11090.71780
41    NaN  female  36.630         2     no  southeast   4949.75870
243   NaN    male  35.300         3     no  southwest   7196.86700
253   NaN    male  30.300         3    NaN  southwest   4260.74400
323   NaN    male  40.945         0     no  northeast  11566.30055
412   NaN  female  17.195         2    yes  northeast  14455.64405
449   NaN    male  38.600         1     no  southwest   4762.32900
761   NaN    male  35.200         1     no  southwest   2416.95500
873   NaN    male  30.100         1     no  southwest   6849.02600
914   NaN    male  24.605         2     no  northwest   5257.50795
941   NaN  female  46.090         1     no  southeast   9549.56510
1060  NaN    male  32.010         0     no  southeast   1981.58190
1156  NaN    male  44.880         0    yes  southeast  39722.74620
1196  NaN  female  30.020         0    yes  northwest  33307.55080
1304  NaN    male  24.605         2    yes  northeast  21259.37795

In [95]:
df = df.dropna()
df

       age     sex     bmi  children smoker     region      charges
0     19.0  female  27.900         0    yes  southwest  16884.92400
1     18.0    male  33.770         1     no  southeast   1725.55230
2     28.0    male  33.000         3     no  southeast   4449.46200
3     33.0    male  22.705         0     no  northwest  21984.47061
4     32.0    male  28.880         0     no  northwest   3866.85520
...    ...     ...     ...       ...    ...        ...          ...
1333  50.0    male  30.970         3     no  northwest  10600.54830
1334  18.0  female  31.920         0     no  northeast   2205.98080
1335  18.0  female  36.850         0     no  southeast   1629.83350
1336  21.0  female  25.800         0     no  southwest   2007.94500
1337  61.0  female  29.070         0    yes  northwest  29141.36030

[1243 rows x 7 columns]

In [121]:
df.loc[:, 'age'] = df['age'].fillna(df['age'].mean())
df

            age     sex     bmi  children smoker     region      charges
0     39.182937     NaN  27.900         0    yes  southwest  16884.92400
1     39.182937    male  33.770         1     no  southeast   1725.55230
2     39.182937    male  33.000         3     no  southeast   4449.46200
3     39.182937    male  22.705         0     no  northwest  21984.47061
4     39.182937    male  28.880         0     no  northwest   3866.85520
...         ...     ...     ...       ...    ...        ...          ...
1333  39.182937    male  30.970         3     no  northwest  10600.54830
1334  39.182937  female  31.920         0     no  northeast   2205.98080
1335  39.182937  female  36.850         0     no  southeast   1629.83350
1336  39.182937  female  25.800         0     no  southwest   2007.94500
1337  39.182937  female  29.070         0    yes  northwest  29141.36030

[1243 rows x 7 columns]

In [126]:
df.loc[:, 'sex'] = df['sex'].fillna('male')

In [154]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1333    False
1334    False
1335    False
1336    False
1337    False
Length: 1243, dtype: bool

In [139]:
df[df.duplicated()]

           age   sex    bmi  children smoker     region    charges
581  39.182937  male  30.59         0     no  northwest  1639.5631

In [169]:
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1337 rows x 7 columns]

In [168]:
df.duplicated(subset='age')

0       False
1       False
2       False
3       False
4       False
        ...
1333     True
1334     True
1335     True
1336     True
1337     True
Length: 1337, dtype: bool

In [187]:
df.shape

(1338, 7)

In [166]:
df.drop_duplicates(inplace=True)

In [178]:
df.drop_duplicates(subset='age', keep=False, inplace=True)

In [183]:
df.isnull().sum()

age         5
sex         3
bmi         5
children    0
smoker      3
region      0
charges     0
dtype: int64

In [189]:
df.head(5)

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900         0    yes  southwest  16884.92400
1  18.0    male  33.770         1     no  southeast   1725.55230
2  28.0    male  33.000         3     no  southeast   4449.46200
3  33.0    male  22.705         0     no  northwest  21984.47061
4  32.0    male  28.880         0     no  northwest   3866.85520

In [197]:
avg_age = df['age'].mean()
df.loc[:, 'age'] = df['age'].fillna(avg_age)

       age     sex     bmi  children smoker     region      charges
0     19.0  female  27.900         0    yes  southwest  16884.92400
1     18.0    male  33.770         1     no  southeast   1725.55230
2     28.0    male  33.000         3     no  southeast   4449.46200
3     33.0    male  22.705         0     no  northwest  21984.47061
4     32.0    male  28.880         0     no  northwest   3866.85520
...    ...     ...     ...       ...    ...        ...          ...
1333  50.0    male  30.970         3     no  northwest  10600.54830
1334  18.0  female  31.920         0     no  northeast   2205.98080
1335  18.0  female  36.850         0     no  southeast   1629.83350
1336  21.0  female  25.800         0     no  southwest   2007.94500
1337  61.0  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [242]:
df.isnull().sum()

age         26
sex          0
bmi         26
children     1
smoker      19
region       1
charges      1
dtype: int64

In [203]:
avg_bmi = df['bmi'].mean()
df.loc[:, 'bmi'] = df['bmi'].fillna(avg_bmi)
df

       age     sex     bmi  children smoker     region      charges
0     19.0  female  27.900         0    yes  southwest  16884.92400
1     18.0    male  33.770         1     no  southeast   1725.55230
2     28.0    male  33.000         3     no  southeast   4449.46200
3     33.0    male  22.705         0     no  northwest  21984.47061
4     32.0    male  28.880         0     no  northwest   3866.85520
...    ...     ...     ...       ...    ...        ...          ...
1333  50.0    male  30.970         3     no  northwest  10600.54830
1334  18.0  female  31.920         0     no  northeast   2205.98080
1335  18.0  female  36.850         0     no  southeast   1629.83350
1336  21.0  female  25.800         0     no  southwest   2007.94500
1337  61.0  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [229]:
df['sex'].value_counts()

sex
male      664
female    660
Name: count, dtype: int64

In [214]:
df.loc[:, 'sex'] = df['sex'].fillna('male')
df

       age     sex     bmi  children smoker     region      charges
0     19.0  female  27.900         0    yes  southwest  16884.92400
1     18.0    male  33.770         1     no  southeast   1725.55230
2     28.0    male  33.000         3     no  southeast   4449.46200
3     33.0    male  22.705         0     no  northwest  21984.47061
4     32.0    male  28.880         0     no  northwest   3866.85520
...    ...     ...     ...       ...    ...        ...          ...
1333  50.0    male  30.970         3     no  northwest  10600.54830
1334  18.0  female  31.920         0     no  northeast   2205.98080
1335  18.0  female  36.850         0     no  southeast   1629.83350
1336  21.0  female  25.800         0     no  southwest   2007.94500
1337  61.0  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [239]:
freq = df['sex'].mode()[0]
df['sex'] = df['sex'].fillna(freq)

In [240]:
pr = df.loc[
    (df['sex'].isnull())
]
pr

Empty DataFrame
Columns: [age, sex, bmi, children, smoker, region, charges]
Index: []

In [255]:
pr1 = df.loc[
    (df['smoker'].isnull())
]
pr1.head(5)

Empty DataFrame
Columns: [age, sex, bmi, children, smoker, region, charges]
Index: []

In [254]:
frq = df['smoker'].mode()[0]
df['smoker'] = df['smoker'].fillna(frq)